'''
Да се напише програма, която конвертира текст към морзов код и обратно.
Допълнително: Създайте функция, която да възпроизвежда морзовия код в
звуков сигнал.

Поддържат се всички букви и цифри на латиница, както и допълнителни символи:
, . ? - ( ) и интервал.

Използва се модула winsound за възпроизвеждане на звукови сигнали
предвид че функцията Beep() не блокира треда, използваме time.sleep()
за да забавим фор цикъла, който възпроизвежда звуковите сигнали
'''

import winsound
import time

def text_to_morse(text):
    morse_code = {
        'A': '.-', 'B': '-...', 'C': '-.-.', 'D': '-..', 'E': '.',
        'F': '..-.', 'G': '--.', 'H': '....', 'I': '..', 'J': '.---',
        'K': '-.-', 'L': '.-..', 'M': '--', 'N': '-.', 'O': '---',
        'P': '.--.', 'Q': '--.-', 'R': '.-.', 'S': '...', 'T': '-',
        'U': '..-', 'V': '...-', 'W': '.--', 'X': '-..-', 'Y': '-.--',
        'Z': '--..', '1': '.----', '2': '..---', '3': '...--', '4': '....-',
        '5': '.....', '6': '-....', '7': '--...', '8': '---..', '9': '----.',
        '0': '-----', ',': '--..--', '.': '.-.-.-', '?': '..--..',
        '-': '-....-', '(': '-.--.', ')': '-.--.-', ' ': '/'
    }
    morse = ''
    for char in text:
        morse += morse_code[char.upper()] + ' '
    return morse

def morse_to_text(morse):
    morse_code = {
        '.-': 'A', '-...': 'B', '-.-.': 'C', '-..': 'D', '.': 'E',
        '..-.': 'F', '--.': 'G', '....': 'H', '..': 'I', '.---': 'J',
        '-.-': 'K', '.-..': 'L', '--': 'M', '-.': 'N', '---': 'O',
        '.--.': 'P', '--.-': 'Q', '.-.': 'R', '...': 'S', '-': 'T',
        '..-': 'U', '...-': 'V', '.--': 'W', '-..-': 'X', '-.--': 'Y',
        '--..': 'Z', '.----': '1', '..---': '2', '...--': '3', '....-': '4',
        '.....': '5', '-....': '6', '--...': '7', '---..': '8', '----.': '9',
        '-----': '0', '--..--': ',', '.-.-.-': '.', '..--..': '?',
        '-....-': '-', '-.--.': '(', '-.--.-': ')', '/': ' '
    }
    text = ''
    for char in morse.split():
        text += morse_code[char]
    return text

def play_morse(morse):
    for char in morse:
        if char == '.':
            winsound.Beep(2000, 100)
            time.sleep(0.1)
        elif char == '-':
            winsound.Beep(2000, 300)
            time.sleep(0.3)
        elif char == '/': # space
            time.sleep(0.2)
        elif char == ' ':
            time.sleep(0.05)

def main():
    text = input("Enter text: ")
    morse = text_to_morse(text)
    print(f"Text to morse: {morse}")
    play_morse(morse)
    text_from_morse = morse_to_text(morse)
    print(f"Morse to text: {text_from_morse}")

main()